#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_policy_document.assume_eks-worker_role: Reading...
data.aws_iam_policy_document.assume_eks_role: Reading...
data.aws_vpc.legacy-vpc: Reading...
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
data.aws_vpc.legacy-vpc: Read complete after 0s [id=vpc-0c972480e791df4a8]
data.aws_subnets.eks_subnets: Reading...
data.aws_subnets.eks_subnets: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_security_group.eks-cluster-sg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_security_group" "eks-cluster-sg" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = (known after apply)

      + filter {
          + name   = "description"
          + values = [
              + "EKS created security group applied to ENI that is attached to EKS Control Plane master nodes, as well as any managed workloads.",
            ]
        }
    }

  # aws_eks_addon.example will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-master-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + tags_all                    = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
    }

  # aws_eks_cluster.eks will be created
  + resource "aws_eks_cluster" "eks" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "dev-master-cluster"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "ctf"     = "WW91IGdvdCBpdCEgbmljZS4="
          + "product" = "master-the-legacy"
        }
      + tags_all                  = {
          + "ctf"         = "WW91IGdvdCBpdCEgbmljZS4="
          + "environment" = "dev"
          + "owners"      = "minders"
          + "product"     = "master-the-legacy"
          + "project"     = "master-the-legacy"
        }
      + version                   = "1.27"

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = "10.100.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = [
              + "subnet-00d2d1f5c616a53db",
              + "subnet-0e3de7ff36b886018",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group-0 will be created
  + resource "aws_eks_node_group" "node-group-0" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-master-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
          + "t3a.small",
        ]
      + node_group_name        = "dev-master-node-group-0"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00d2d1f5c616a53db",
        ]
      + tags_all               = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_eks_node_group.node-group-1 will be created
  + resource "aws_eks_node_group" "node-group-1" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-master-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
          + "t3a.small",
        ]
      + node_group_name        = "dev-master-node-group-1"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0e3de7ff36b886018",
        ]
      + tags_all               = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_role.legacy_eks-worker_role will be created
  + resource "aws_iam_role" "legacy_eks-worker_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-legacy-eks-worker-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.legacy_eks_role will be created
  + resource "aws_iam_role" "legacy_eks_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-legacy-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "dev-legacy-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEC2RoleforSSM will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2RoleforSSM" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM"
      + role       = "dev-legacy-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "dev-legacy-eks-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "dev-legacy-eks-worker-role"
    }

  # aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "dev-legacy-eks-worker-role"
    }

  # aws_route53_zone.private-zone will be created
  + resource "aws_route53_zone" "private-zone" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev.master.legacy.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + zone_id             = (known after apply)

      + vpc {
          + vpc_id     = "vpc-0c972480e791df4a8"
          + vpc_region = (known after apply)
        }
    }

  # aws_vpc_endpoint.vpce["ec2"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ec2"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00d2d1f5c616a53db",
          + "subnet-0e3de7ff36b886018",
        ]
      + tags                  = {
          + "Name" = "vpce-ec2"
        }
      + tags_all              = {
          + "Name"        = "vpce-ec2"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0c972480e791df4a8"
    }

  # aws_vpc_endpoint.vpce["ec2messages"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ec2messages"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00d2d1f5c616a53db",
          + "subnet-0e3de7ff36b886018",
        ]
      + tags                  = {
          + "Name" = "vpce-ec2messages"
        }
      + tags_all              = {
          + "Name"        = "vpce-ec2messages"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0c972480e791df4a8"
    }

  # aws_vpc_endpoint.vpce["eks"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.eks"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00d2d1f5c616a53db",
          + "subnet-0e3de7ff36b886018",
        ]
      + tags                  = {
          + "Name" = "vpce-eks"
        }
      + tags_all              = {
          + "Name"        = "vpce-eks"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0c972480e791df4a8"
    }

  # aws_vpc_endpoint.vpce["ssm"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ssm"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00d2d1f5c616a53db",
          + "subnet-0e3de7ff36b886018",
        ]
      + tags                  = {
          + "Name" = "vpce-ssm"
        }
      + tags_all              = {
          + "Name"        = "vpce-ssm"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0c972480e791df4a8"
    }

  # aws_vpc_endpoint.vpce["ssmmessages"] will be created
  + resource "aws_vpc_endpoint" "vpce" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ssmmessages"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-00d2d1f5c616a53db",
          + "subnet-0e3de7ff36b886018",
        ]
      + tags                  = {
          + "Name" = "vpce-ssmmessages"
        }
      + tags_all              = {
          + "Name"        = "vpce-ssmmessages"
          + "environment" = "dev"
          + "owners"      = "minders"
          + "project"     = "master-the-legacy"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0c972480e791df4a8"
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint                              = (known after apply)
  + kubeconfig-certificate-authority-data = (sensitive value)
  + oidc-issuer                           = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @benhur-sre, Action: `pull_request`, Working Directory: ``, Workflow: `scaffold-development`*